package note;

public class note1_exam {
	/*   <1차 시험>
	  211.84.35.64 : ip address ex)사창사거리 몇번지 ㅇㅇ약국
	  http://www.naver.com : domain name ex)사창사거리 ㅇㅇ약국
	  DNS : ip address 를 쳐도 domain name으로 들어갈수있게해줌
	  
	  port 번호 65535개의 포트가 있음.
	  웹사이트를 들어 갈 수 있는 포트번호는 80번부터
	  211.84.35.64:80  ->80은 포트번호 (80번부터는 포트를 생략 가능)
	  
	  1계층 : 물리 
	  2계층 : 데이터 링크
	  3계층 : 네트워크 (인터넷계층) 
	  4계층 : 트랜스 (전송)
	  5계층 : 세션 
	  6계층 : 프렌테이션 레이어 (표현)
	  7계층 : 어플리케이션 (응용계층)
	  
	  자바스크립트로 악성코드 만들수있음	  
	  
	  
	  
	  
	  
	  
	  
	  
	  
	  
	  
	  
	  
	  
	  
	  
	  
	  
	  
	 */
	

}
